# تعريف مجموعتين a و b
# استخدام issuperset() للتحقق مما إذا كانت المجموعة تحتوي على مجموعة فرعية أخرى
a = {1, 2, 3, 4}
b = {1, 2, 3}
print(a.issuperset(b))  # النتيجة: True (a تحتوي على جميع عناصر b)
print(b.issuperset(a))  # النتيجة: False (b لا تحتوي على جميع عناصر a)

---

# استخدام issubset() للتحقق مما إذا كانت المجموعة فرعية من مجموعة أخرى
a = {1, 2, 3, 4}
b = {1, 2, 3}
print(a.issubset(b))  # النتيجة: False (a ليست فرعية من b)
print(b.issubset(a))  # النتيجة: True (b فرعية من a)

---

# استخدام isdisjoint() للتحقق مما إذا كانت المجموعتان لا تحتويان على عناصر مشتركة
a = {1, 2, 3, 4}
b = {1, 2, 3}
c = {'one', 'two'}
print(a.isdisjoint(b))  # النتيجة: False (a و b تحتويان على عناصر مشتركة)
print(b.isdisjoint(c))  # النتيجة: True (b و c لا تحتويان على أي عناصر مشتركة)
